chtMultiregionFoam/snappyLayeradd_exptcase/constant/sphere/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/sphere/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1
(
    sphere_to_oil
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          24344;
        startFace       134855;
        sampleMode      nearestPatchFace;
        sampleRegion    oil;
        samplePatch     oil_to_sphere;
    }

)


// ************************************************************************* //
